// Задача: Написать программу, которая из имеющегося массива строк формирует массив из строк, 
// длина которых меньше либо равна 3 символа. 
// Первоначалььный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. 
// При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


string[] array1 = new string[7] { "кот", "мышь", "дом", "огонь", "1234", "356", "сажа" }; // Задаем первый массив

string[] array2 = new string[array1.Length]; // Задаем второй массив